import Image from "next/image";
import PageContainer from "../components/UI/PageContainer";

export default function Important() {
    return(
        <PageContainer>
            <h2>Важливо!</h2>
            <h3>
                <p>
                    Не обприскуйте тераріум вдень, коли горить лампа або тоді, коли вона тільки-но вимкнулась.
                    Якщо крапля води попаде на гарячу лампу, то вона лусне. Тому обприскуйте тільки тоді, коли лампа охолола.
                    До речі, якщо розпилювати тераріум дистильованою водою, то на стінках тераріуму згодом не буде ніяких слідів від води,
                    тоді як після розпилення звичайної питної води згодом сліди будуть, бо у живій воді є мікроелементи, які залишаться на склі.
                </p>
                <p>
                    Ні в якому разі не ставте тераріум на протязі.
                </p>
                <p>
                    Не вигулюйте змію на вулиці, їй не потрібні вуличні бактерії, вона може захворіти і вмерти.
                    І ультрафіолет їй теж не потрібен.
                </p>
                <p>
                    Не чіпайте змію руками, які пахнуть мишами — вкусить.
                    Взагалі, беріть змію чистими руками.
                </p>                
                <p>
                    Змію не треба брати на руки безперервно. Це може викликати стрес.
                    І пускати поповзати по квартирі теж не потрібно.
                    У неї повинна бути своя температура і вологість у тераріумі/контейнері.
                </p>
            </h3>
            <div>
                <Image                            
                    layout='intrinsic'
                    alt='feeding'
                    src='/pic/lin2.png'
                    width={669}
                    height={192}
                    quality='100'
                />
            </div>
        </PageContainer>
    );
}