import Image from "next/image";
import PageContainer from "../components/UI/PageContainer";
import styles from '../components/UI/PageContainer.module.css';

export default function Lifehacks() {
    return(
        <PageContainer>
            <h2>Лайфхаки та Поради</h2>
            <h3>
                <p>
                    Щоб не вмикати і вимикати освітлення/обігрів у тераріумі кожного ранку і вночі, купіть таймер-розетку.
                    Налаштуйте його на 12 годин і вам не треба буде слідкувати за світловим режимом.
                    Таймер-розетку не купуйте в зоомагазинах, бо там вона дуже дорога тільки тому, що вона зроблена &ldquo;спеціально&rdquo; для тварин.
                    Але це ж просто таймер, це просто маркетинговий хід. Купуйте у звичайному магазині або в інтернеті.
                    Тоді її ціна буде у три рази менше.
                </p>
            </h3>
            <div>
                <Image                            
                    layout='intrinsic'
                    alt='lifehacks'
                    src='/pic/lifehacks/lifehacks1.jpg'
                    width={278}
                    height={248}
                    quality='100'
                />
                <Image                            
                    layout='intrinsic'
                    alt='lifehacks'
                    src='/pic/lifehacks/lifehacks2.jpg'
                    width={278}
                    height={248}
                    quality='100'
                />
            </div>
            <h3>
                <p className={styles.stress}>
                    Вкусила змія, що робити?!
                </p>
                <p>
                    Якщо вже вийшло так, що в маїса прокинувся харчовий інстинкт
                    (наприклад через те, що ви тримали гризуна на руках перед тим, як торкатися змії)
                    укусив і не хоче вас відпускати, то ні в якому разі не смикайте його та не намагайтесь самі відірвати його,
                    інакше ви вирвете зуби. В усіх змій зуби вогнуті всередину, саме тому при смикані ви будете ще більше вганяти їх,
                    а різким рухом зовсім їх зламаєте.
                </p>
                <p>
                    Щоб не завдати шкоди свому улюбленцю, можете робити наступним чином:
                </p>
                <ul>
                    <li>мирно чекати допоки змія сама вас не відпустить;</li>
                    <li>побризкати на голову маїса водою з розпилювача;</li>
                    <li>піднести під проточну воду.</li>
                </ul>
                <p>
                    Пам'ятайте, що найголовніше – це обережність і правильний догляд.
                </p>
            </h3>
        </PageContainer>
    );
}