import Image from "next/image";
import PageContainer from "../components/UI/PageContainer";

export default function Terrarium() {
    return(
        <PageContainer>
            <h2>Тераріум</h2>
            <h3>
                <p>
                    Мінімальний розмір 60х40х40 на одну змію. Обов’язково горизонтального типу.
                    Дуже великий тераріум теж не потрібен. Оптимальний розмір 70(або 80)х40х40 (чи 45-50, не важливо).
                </p>
                <p>
                    Не садіть маленьку змію одразу у великий тераріум. Нехай спершу посидить у контейнері на 15-30л, не більше.
                    У великому тераріумі маленька змія може відчувати великий стрес і відмовлятись від їжі.
                    Пересадити можна буде десь через півроку-рік.
                </p>
                <p>
                    Замість тераріуму можна використовувати харчовий контейнер,
                    але тоді в ньому потрібно буде зробити <span>правильну проточну вентиляцію</span>.
                    Дивіться, щоб дірки були не такі великі, щоб змія змогла втекти. Якщо голова пролізе — пролізе і змія.
                    Приклад проточної вентиляції на фото:
                </p>
            </h3>
            <div>
                <Image                            
                    layout='intrinsic'
                    alt='terrarium'
                    src='/pic/terrarium/terrarium1.jpg'
                    width={392}
                    height={196}
                    quality='100'
                />
                <Image                            
                    layout='intrinsic'
                    alt='terrarium'
                    src='/pic/terrarium/terrarium2.jpg'
                    width={392}
                    height={196}
                    quality='100'
                />
            </div>            
        </PageContainer>
    );
}